Project-LAKSA/Project_LAKSA/firmware/esp32-s3/src/micro_ros_bridge.c
#include "micro_ros_bridge.h"

#include <math.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "esp_log.h"
#include "esp_timer.h"
#include "esp_usbcdc_transport.h"
#include "esp32_config.h"
#include "freertos/task.h"
#include "sdkconfig.h"

#include <geometry_msgs/msg/twist.h>
#include <laksa_interfaces/msg/drive_command.h>
#include <laksa_interfaces/msg/vehicle_state.h>
#include <laksa_interfaces/msg/vesc_state.h>
#include <laksa_interfaces/srv/get_vehicle_state.h>
#include <laksa_interfaces/srv/set_drive_command.h>
#include <rcl/rcl.h>
#include <rclc/executor.h>
#include <rclc/rclc.h>
#include <rmw_microros/rmw_microros.h>
#include <rosidl_runtime_c/string_functions.h>
#include <sensor_msgs/msg/imu.h>
#include <sensor_msgs/msg/magnetic_field.h>

#define MICRO_ROS_TASK_STACK_SIZE 20000
#define MICRO_ROS_TASK_PRIORITY 5
#define MICRO_ROS_EXECUTOR_HANDLES 4
#define MICRO_ROS_IMU_PERIOD_MS 20
#define MICRO_ROS_MAG_PERIOD_MS 50
#define MICRO_ROS_STATE_PERIOD_MS 100
#define MICRO_ROS_AGENT_PING_PERIOD_MS 500
#define MICRO_ROS_AGENT_PING_TIMEOUT_MS 100
#define MICRO_ROS_AGENT_PING_ATTEMPTS 1
#define MICRO_ROS_RETRY_PERIOD_MS 500
#define MICRO_ROS_PI 3.14159265358979323846f
#define MICRO_ROS_UT_TO_T 0.000001f

typedef enum {
    BRIDGE_WAITING_FOR_AGENT,
    BRIDGE_AGENT_AVAILABLE,
    BRIDGE_AGENT_CONNECTED,
    BRIDGE_AGENT_DISCONNECTED,
} bridge_connection_state_t;

typedef struct {
    micro_ros_bridge_config_t hardware;
    rcl_allocator_t allocator;
    rclc_support_t support;
    rcl_node_t node;
    rclc_executor_t executor;
    rcl_publisher_t imu_publisher;
    rcl_publisher_t mag_publisher;
    rcl_publisher_t vesc_publisher;
    rcl_publisher_t state_publisher;
    rcl_subscription_t command_subscription;
    rcl_subscription_t cmd_vel_subscription;
    rcl_service_t set_command_service;
    rcl_service_t get_state_service;
    sensor_msgs__msg__Imu imu_message;
    sensor_msgs__msg__MagneticField mag_message;
    laksa_interfaces__msg__VescState vesc_message;
    laksa_interfaces__msg__VehicleState state_message;
    laksa_interfaces__msg__DriveCommand command_message;
    geometry_msgs__msg__Twist cmd_vel_message;
    laksa_interfaces__srv__SetDriveCommand_Request set_request;
    laksa_interfaces__srv__SetDriveCommand_Response set_response;
    laksa_interfaces__srv__GetVehicleState_Request get_request;
    laksa_interfaces__srv__GetVehicleState_Response get_response;
    bool entities_created;
} micro_ros_bridge_t;

static const char *TAG = "micro_ros";
static micro_ros_bridge_t bridge;
static tinyusb_cdcacm_itf_t cdc_port = TINYUSB_CDC_ACM_0;

static void consume_rcl_result(rcl_ret_t result)
{
    (void)result;
}

static float wheel_diameter_m(void)
{
    return (float)CONFIG_LAKSA_WHEEL_DIAMETER_MM / 1000.0f;
}

static float gear_reduction(void)
{
    return (float)CONFIG_LAKSA_GEAR_REDUCTION_X1000 / 1000.0f;
}

static float max_steering_angle_rad(void)
{
    return (float)CONFIG_LAKSA_MAX_STEERING_ANGLE_MRAD / 1000.0f;
}

static bool speed_to_erpm(float speed_mps, int32_t *erpm)
{
    if (erpm == NULL || !isfinite(speed_mps)) {
        return false;
    }

    float circumference_m = MICRO_ROS_PI * wheel_diameter_m();
    float value = speed_mps * 60.0f * gear_reduction() *
                  (float)CONFIG_LAKSA_MOTOR_POLE_PAIRS /
                  circumference_m * (float)CONFIG_LAKSA_DRIVE_FORWARD_SIGN;
    if (!isfinite(value) || fabsf(value) > (float)VESC_MAX_ABS_RPM) {
        return false;
    }

    *erpm = (int32_t)lroundf(value);
    return true;
}

static float erpm_to_speed(float erpm)
{
    float circumference_m = MICRO_ROS_PI * wheel_diameter_m();
    return erpm * circumference_m /
           (60.0f * gear_reduction() * (float)CONFIG_LAKSA_MOTOR_POLE_PAIRS) *
           (float)CONFIG_LAKSA_DRIVE_FORWARD_SIGN;
}

static bool steering_rad_to_servo(float steering_rad, uint8_t *servo_angle_deg)
{
    if (servo_angle_deg == NULL || !isfinite(steering_rad) ||
        fabsf(steering_rad) > max_steering_angle_rad()) {
        return false;
    }

    float normalized = fabsf(steering_rad) / max_steering_angle_rad();
    float servo_angle;
    if (steering_rad >= 0.0f) {
        servo_angle = (float)STEERING_CENTER_DEG -
                      normalized * (float)(STEERING_CENTER_DEG - STEERING_LEFT_SAFE_DEG);
    } else {
        servo_angle = (float)STEERING_CENTER_DEG +
                      normalized * (float)(STEERING_RIGHT_SAFE_DEG - STEERING_CENTER_DEG);
    }
    *servo_angle_deg = (uint8_t)lroundf(servo_angle);
    return true;
}

static float servo_to_steering_rad(uint8_t servo_angle_deg)
{
    if (servo_angle_deg <= STEERING_CENTER_DEG) {
        return ((float)(STEERING_CENTER_DEG - servo_angle_deg) /
                (float)(STEERING_CENTER_DEG - STEERING_LEFT_SAFE_DEG)) *
               max_steering_angle_rad();
    }
    return -((float)(servo_angle_deg - STEERING_CENTER_DEG) /
             (float)(STEERING_RIGHT_SAFE_DEG - STEERING_CENTER_DEG)) *
           max_steering_angle_rad();
}

static uint8_t apply_drive_command(float speed_mps, float steering_angle_rad)
{
    int32_t erpm;
    uint8_t servo_angle;
    if (!speed_to_erpm(speed_mps, &erpm)) {
        return 1;
    }
    if (!steering_rad_to_servo(steering_angle_rad, &servo_angle)) {
        return 2;
    }
    if (vesc_uart_set_target_rpm(bridge.hardware.vesc, erpm) != ESP_OK) {
        return 3;
    }
    if (steering_control_set_target(bridge.hardware.steering, servo_angle) != ESP_OK) {
        (void)vesc_uart_set_target_rpm(bridge.hardware.vesc, 0);
        return 4;
    }
    return 0;
}

static builtin_interfaces__msg__Time ros_time_now(void)
{
    int64_t nanoseconds = rmw_uros_epoch_synchronized()
                              ? rmw_uros_epoch_nanos()
                              : esp_timer_get_time() * 1000LL;
    builtin_interfaces__msg__Time stamp = {
        .sec = (int32_t)(nanoseconds / 1000000000LL),
        .nanosec = (uint32_t)(nanoseconds % 1000000000LL),
    };
    return stamp;
}

static void read_imu(bno08x_adapter_vec3_t *accel,
                     bno08x_adapter_vec3_t *gyro,
                     bno08x_adapter_vec3_t *mag_ut,
                     bno08x_adapter_quat_t *rotation,
                     bool *has_accel,
                     bool *has_gyro,
                     bool *has_mag,
                     bool *has_rotation)
{
    *has_accel = false;
    *has_gyro = false;
    *has_mag = false;
    *has_rotation = false;
    if (bridge.hardware.imu == NULL) {
        return;
    }

    if (bridge.hardware.hardware_mutex != NULL) {
        xSemaphoreTake(bridge.hardware.hardware_mutex, portMAX_DELAY);
    }
    *has_accel = bno08x_adapter_get_acceleration(bridge.hardware.imu, accel) == ESP_OK;
    *has_gyro = bno08x_adapter_get_angular_velocity(bridge.hardware.imu, gyro) == ESP_OK;
    *has_mag = bno08x_adapter_get_magnetic_field(bridge.hardware.imu, mag_ut) == ESP_OK;
    *has_rotation = bno08x_adapter_get_rotation_vector(bridge.hardware.imu, rotation) == ESP_OK;
    if (bridge.hardware.hardware_mutex != NULL) {
        xSemaphoreGive(bridge.hardware.hardware_mutex);
    }
}

