Project-LAKSA/Project_LAKSA/firmware/esp32-s3/src/micro_ros_bridge.c
static void fill_vesc_state(laksa_interfaces__msg__VescState *message,
                            const vesc_uart_snapshot_t *snapshot,
                            builtin_interfaces__msg__Time stamp)
{
    float speed_mps = erpm_to_speed(snapshot->measured_rpm);
    message->stamp = stamp;
    message->command_fresh = snapshot->command_fresh;
    message->direction_change_pending = snapshot->direction_change_pending;
    message->telemetry_fresh = snapshot->telemetry_fresh;
    message->requested_erpm = snapshot->requested_rpm;
    message->active_erpm = snapshot->active_rpm;
    message->measured_erpm = snapshot->measured_rpm;
    message->motor_current_a = snapshot->motor_current;
    message->input_current_a = snapshot->input_current;
    message->duty_cycle = snapshot->duty_cycle;
    message->input_voltage_v = snapshot->input_voltage;
    message->amp_hours = snapshot->amp_hours;
    message->amp_hours_charged = snapshot->amp_hours_charged;
    message->watt_hours = snapshot->watt_hours;
    message->watt_hours_charged = snapshot->watt_hours_charged;
    message->temp_mosfet_c = snapshot->temp_mosfet;
    message->temp_motor_c = snapshot->temp_motor;
    message->pid_position = snapshot->pid_position;
    message->tachometer = snapshot->tachometer;
    message->tachometer_abs = snapshot->tachometer_abs;
    message->controller_id = snapshot->controller_id;
    message->fault_code = snapshot->fault_code;
    message->motor_angular_velocity_rad_s =
        snapshot->measured_rpm / (float)CONFIG_LAKSA_MOTOR_POLE_PAIRS *
        (2.0f * MICRO_ROS_PI / 60.0f);
    message->wheel_angular_velocity_rad_s = speed_mps / (wheel_diameter_m() * 0.5f);
    message->vehicle_linear_velocity_mps = speed_mps;
}

static void fill_vehicle_state(laksa_interfaces__msg__VehicleState *state)
{
    bno08x_adapter_vec3_t accel = {0};
    bno08x_adapter_vec3_t gyro = {0};
    bno08x_adapter_vec3_t mag_ut = {0};
    bno08x_adapter_quat_t rotation = {0};
    bool has_accel, has_gyro, has_mag, has_rotation;
    steering_snapshot_t steering = {0};
    vesc_uart_snapshot_t vesc = {0};
    builtin_interfaces__msg__Time stamp = ros_time_now();

    read_imu(&accel, &gyro, &mag_ut, &rotation,
             &has_accel, &has_gyro, &has_mag, &has_rotation);
    (void)steering_control_get_snapshot(bridge.hardware.steering, &steering);
    (void)vesc_uart_get_snapshot(bridge.hardware.vesc, &vesc);

    state->stamp = stamp;
    state->imu_available = has_accel || has_gyro || has_mag || has_rotation;
    state->orientation.x = rotation.i;
    state->orientation.y = rotation.j;
    state->orientation.z = rotation.k;
    state->orientation.w = has_rotation ? rotation.real : 1.0;
    state->orientation_accuracy_rad = rotation.accuracy;
    state->angular_velocity_rad_s.x = gyro.x;
    state->angular_velocity_rad_s.y = gyro.y;
    state->angular_velocity_rad_s.z = gyro.z;
    state->linear_acceleration_m_s2.x = accel.x;
    state->linear_acceleration_m_s2.y = accel.y;
    state->linear_acceleration_m_s2.z = accel.z;
    state->magnetic_field_t.x = mag_ut.x * MICRO_ROS_UT_TO_T;
    state->magnetic_field_t.y = mag_ut.y * MICRO_ROS_UT_TO_T;
    state->magnetic_field_t.z = mag_ut.z * MICRO_ROS_UT_TO_T;
    fill_vesc_state(&state->vesc, &vesc, stamp);
    state->steering_target_rad = servo_to_steering_rad(steering.target_angle_deg);
    state->steering_current_rad = servo_to_steering_rad(steering.current_angle_deg);
    state->steering_endpoint_relief_active = steering.endpoint_relief_active;
}

static void fill_imu_messages(void)
{
    bno08x_adapter_vec3_t accel = {0};
    bno08x_adapter_vec3_t gyro = {0};
    bno08x_adapter_vec3_t mag_ut = {0};
    bno08x_adapter_quat_t rotation = {0};
    bool has_accel, has_gyro, has_mag, has_rotation;
    builtin_interfaces__msg__Time stamp = ros_time_now();

    read_imu(&accel, &gyro, &mag_ut, &rotation,
             &has_accel, &has_gyro, &has_mag, &has_rotation);

    bridge.imu_message.header.stamp = stamp;
    bridge.imu_message.orientation.x = rotation.i;
    bridge.imu_message.orientation.y = rotation.j;
    bridge.imu_message.orientation.z = rotation.k;
    bridge.imu_message.orientation.w = has_rotation ? rotation.real : 1.0;
    bridge.imu_message.orientation_covariance[0] = has_rotation ? 0.0 : -1.0;
    bridge.imu_message.angular_velocity.x = gyro.x;
    bridge.imu_message.angular_velocity.y = gyro.y;
    bridge.imu_message.angular_velocity.z = gyro.z;
    bridge.imu_message.angular_velocity_covariance[0] = has_gyro ? 0.0 : -1.0;
    bridge.imu_message.linear_acceleration.x = accel.x;
    bridge.imu_message.linear_acceleration.y = accel.y;
    bridge.imu_message.linear_acceleration.z = accel.z;
    bridge.imu_message.linear_acceleration_covariance[0] = has_accel ? 0.0 : -1.0;

    bridge.mag_message.header.stamp = stamp;
    bridge.mag_message.magnetic_field.x = mag_ut.x * MICRO_ROS_UT_TO_T;
    bridge.mag_message.magnetic_field.y = mag_ut.y * MICRO_ROS_UT_TO_T;
    bridge.mag_message.magnetic_field.z = mag_ut.z * MICRO_ROS_UT_TO_T;
    bridge.mag_message.magnetic_field_covariance[0] = has_mag ? 0.0 : -1.0;
}

static void command_callback(const void *message)
{
    const laksa_interfaces__msg__DriveCommand *command =
        (const laksa_interfaces__msg__DriveCommand *)message;
    uint8_t error = apply_drive_command(command->speed_mps, command->steering_angle_rad);
    if (error != 0) {
        ESP_LOGW(TAG, "Rejected drive command (error %u)", (unsigned)error);
    }
}

static void cmd_vel_callback(const void *message)
{
    const geometry_msgs__msg__Twist *command = (const geometry_msgs__msg__Twist *)message;
    float speed = (float)command->linear.x;
    float steering = 0.0f;
    if (fabsf(speed) > 0.01f) {
        steering = atanf(((float)CONFIG_LAKSA_WHEELBASE_MM / 1000.0f) *
                         (float)command->angular.z / speed);
    }
    uint8_t error = apply_drive_command(speed, steering);
    if (error != 0) {
        ESP_LOGW(TAG, "Rejected cmd_vel (error %u)", (unsigned)error);
    }
}

static void set_command_callback(const void *request, void *response)
{
    const laksa_interfaces__srv__SetDriveCommand_Request *set_request =
        (const laksa_interfaces__srv__SetDriveCommand_Request *)request;
    laksa_interfaces__srv__SetDriveCommand_Response *set_response =
        (laksa_interfaces__srv__SetDriveCommand_Response *)response;
    set_response->error_code = apply_drive_command(set_request->command.speed_mps,
                                                   set_request->command.steering_angle_rad);
    set_response->accepted = set_response->error_code == 0;
}

static void get_state_callback(const void *request, void *response)
{
    (void)request;
    laksa_interfaces__srv__GetVehicleState_Response *get_response =
        (laksa_interfaces__srv__GetVehicleState_Response *)response;
    fill_vehicle_state(&get_response->state);
}

static bool create_entities(void)
{
    bridge.allocator = rcl_get_default_allocator();
    rcl_init_options_t init_options = rcl_get_zero_initialized_init_options();
    if (rcl_init_options_init(&init_options, bridge.allocator) != RCL_RET_OK ||
        rcl_init_options_set_domain_id(&init_options, CONFIG_LAKSA_ROS_DOMAIN_ID) != RCL_RET_OK ||
        rclc_support_init_with_options(&bridge.support, 0, NULL, &init_options,
                                       &bridge.allocator) != RCL_RET_OK) {
        consume_rcl_result(rcl_init_options_fini(&init_options));
        return false;
    }
    consume_rcl_result(rcl_init_options_fini(&init_options));
    /* Zero-initialized handles can now be finalized if the Agent disappears
       while the remaining XRCE entities are only partially created. */
    bridge.entities_created = true;

    bridge.node = rcl_get_zero_initialized_node();
    if (rclc_node_init_default(&bridge.node, "laksa_esp32", "", &bridge.support) != RCL_RET_OK) {
        return false;
    }

