Project-LAKSA/Project_LAKSA/firmware/esp32-s3/src/micro_ros_bridge.c
    bridge.imu_publisher = rcl_get_zero_initialized_publisher();
    bridge.mag_publisher = rcl_get_zero_initialized_publisher();
    bridge.vesc_publisher = rcl_get_zero_initialized_publisher();
    bridge.state_publisher = rcl_get_zero_initialized_publisher();
    if (rclc_publisher_init_best_effort(&bridge.imu_publisher, &bridge.node,
            ROSIDL_GET_MSG_TYPE_SUPPORT(sensor_msgs, msg, Imu), "/laksa/imu/data") != RCL_RET_OK ||
        rclc_publisher_init_best_effort(&bridge.mag_publisher, &bridge.node,
            ROSIDL_GET_MSG_TYPE_SUPPORT(sensor_msgs, msg, MagneticField), "/laksa/imu/mag") != RCL_RET_OK ||
        rclc_publisher_init_best_effort(&bridge.vesc_publisher, &bridge.node,
            ROSIDL_GET_MSG_TYPE_SUPPORT(laksa_interfaces, msg, VescState), "/laksa/vesc/state") != RCL_RET_OK ||
        rclc_publisher_init_best_effort(&bridge.state_publisher, &bridge.node,
            ROSIDL_GET_MSG_TYPE_SUPPORT(laksa_interfaces, msg, VehicleState), "/laksa/state") != RCL_RET_OK) {
        return false;
    }

    bridge.command_subscription = rcl_get_zero_initialized_subscription();
    bridge.cmd_vel_subscription = rcl_get_zero_initialized_subscription();
    if (rclc_subscription_init_default(&bridge.command_subscription, &bridge.node,
            ROSIDL_GET_MSG_TYPE_SUPPORT(laksa_interfaces, msg, DriveCommand), "/laksa/command") != RCL_RET_OK ||
        rclc_subscription_init_default(&bridge.cmd_vel_subscription, &bridge.node,
            ROSIDL_GET_MSG_TYPE_SUPPORT(geometry_msgs, msg, Twist), "/cmd_vel") != RCL_RET_OK) {
        return false;
    }

    bridge.set_command_service = rcl_get_zero_initialized_service();
    bridge.get_state_service = rcl_get_zero_initialized_service();
    if (rclc_service_init_default(&bridge.set_command_service, &bridge.node,
            ROSIDL_GET_SRV_TYPE_SUPPORT(laksa_interfaces, srv, SetDriveCommand),
            "/laksa/set_drive_command") != RCL_RET_OK ||
        rclc_service_init_default(&bridge.get_state_service, &bridge.node,
            ROSIDL_GET_SRV_TYPE_SUPPORT(laksa_interfaces, srv, GetVehicleState),
            "/laksa/get_state") != RCL_RET_OK) {
        return false;
    }

    if (!sensor_msgs__msg__Imu__init(&bridge.imu_message) ||
        !sensor_msgs__msg__MagneticField__init(&bridge.mag_message) ||
        !laksa_interfaces__msg__VescState__init(&bridge.vesc_message) ||
        !laksa_interfaces__msg__VehicleState__init(&bridge.state_message) ||
        !laksa_interfaces__msg__DriveCommand__init(&bridge.command_message) ||
        !geometry_msgs__msg__Twist__init(&bridge.cmd_vel_message) ||
        !laksa_interfaces__srv__SetDriveCommand_Request__init(&bridge.set_request) ||
        !laksa_interfaces__srv__SetDriveCommand_Response__init(&bridge.set_response) ||
        !laksa_interfaces__srv__GetVehicleState_Request__init(&bridge.get_request) ||
        !laksa_interfaces__srv__GetVehicleState_Response__init(&bridge.get_response)) {
        return false;
    }
    if (!rosidl_runtime_c__String__assign(&bridge.imu_message.header.frame_id, "imu_link") ||
        !rosidl_runtime_c__String__assign(&bridge.mag_message.header.frame_id, "imu_link")) {
        return false;
    }

    bridge.executor = rclc_executor_get_zero_initialized_executor();
    if (rclc_executor_init(&bridge.executor, &bridge.support.context,
                           MICRO_ROS_EXECUTOR_HANDLES, &bridge.allocator) != RCL_RET_OK ||
        rclc_executor_add_subscription(&bridge.executor, &bridge.command_subscription,
                                       &bridge.command_message, command_callback, ON_NEW_DATA) != RCL_RET_OK ||
        rclc_executor_add_subscription(&bridge.executor, &bridge.cmd_vel_subscription,
                                       &bridge.cmd_vel_message, cmd_vel_callback, ON_NEW_DATA) != RCL_RET_OK ||
        rclc_executor_add_service(&bridge.executor, &bridge.set_command_service,
                                  &bridge.set_request, &bridge.set_response,
                                  set_command_callback) != RCL_RET_OK ||
        rclc_executor_add_service(&bridge.executor, &bridge.get_state_service,
                                  &bridge.get_request, &bridge.get_response,
                                  get_state_callback) != RCL_RET_OK) {
        return false;
    }

    (void)rmw_uros_sync_session(1000);
    ESP_LOGI(TAG, "ROS 2 entities ready in domain %d", CONFIG_LAKSA_ROS_DOMAIN_ID);
    return true;
}

static void destroy_entities(void)
{
    (void)vesc_uart_set_target_rpm(bridge.hardware.vesc, 0);
    (void)steering_control_center(bridge.hardware.steering);
    if (!bridge.entities_created) {
        memset(&bridge.support, 0, sizeof(bridge.support));
        return;
    }

    rmw_context_t *rmw_context = rcl_context_get_rmw_context(&bridge.support.context);
    if (rmw_context != NULL) {
        (void)rmw_uros_set_context_entity_destroy_session_timeout(rmw_context, 0);
    }
    (void)rclc_executor_fini(&bridge.executor);
    consume_rcl_result(rcl_service_fini(&bridge.get_state_service, &bridge.node));
    consume_rcl_result(rcl_service_fini(&bridge.set_command_service, &bridge.node));
    consume_rcl_result(rcl_subscription_fini(&bridge.cmd_vel_subscription, &bridge.node));
    consume_rcl_result(rcl_subscription_fini(&bridge.command_subscription, &bridge.node));
    consume_rcl_result(rcl_publisher_fini(&bridge.state_publisher, &bridge.node));
    consume_rcl_result(rcl_publisher_fini(&bridge.vesc_publisher, &bridge.node));
    consume_rcl_result(rcl_publisher_fini(&bridge.mag_publisher, &bridge.node));
    consume_rcl_result(rcl_publisher_fini(&bridge.imu_publisher, &bridge.node));
    consume_rcl_result(rcl_node_fini(&bridge.node));
    (void)rclc_support_fini(&bridge.support);

    sensor_msgs__msg__Imu__fini(&bridge.imu_message);
    sensor_msgs__msg__MagneticField__fini(&bridge.mag_message);
    laksa_interfaces__msg__VescState__fini(&bridge.vesc_message);
    laksa_interfaces__msg__VehicleState__fini(&bridge.state_message);
    laksa_interfaces__msg__DriveCommand__fini(&bridge.command_message);
    geometry_msgs__msg__Twist__fini(&bridge.cmd_vel_message);
    laksa_interfaces__srv__SetDriveCommand_Request__fini(&bridge.set_request);
    laksa_interfaces__srv__SetDriveCommand_Response__fini(&bridge.set_response);
    laksa_interfaces__srv__GetVehicleState_Request__fini(&bridge.get_request);
    laksa_interfaces__srv__GetVehicleState_Response__fini(&bridge.get_response);
    bridge.entities_created = false;
}

static void publish_periodic(TickType_t now,
                             TickType_t *last_imu,
                             TickType_t *last_mag,
                             TickType_t *last_state)
{
    if (now - *last_imu >= pdMS_TO_TICKS(MICRO_ROS_IMU_PERIOD_MS)) {
        *last_imu = now;
        fill_imu_messages();
        consume_rcl_result(rcl_publish(&bridge.imu_publisher, &bridge.imu_message, NULL));
    }
    if (now - *last_mag >= pdMS_TO_TICKS(MICRO_ROS_MAG_PERIOD_MS)) {
        *last_mag = now;
        consume_rcl_result(rcl_publish(&bridge.mag_publisher, &bridge.mag_message, NULL));
    }
    if (now - *last_state >= pdMS_TO_TICKS(MICRO_ROS_STATE_PERIOD_MS)) {
        *last_state = now;
        fill_vehicle_state(&bridge.state_message);
        bridge.vesc_message = bridge.state_message.vesc;
        consume_rcl_result(rcl_publish(&bridge.vesc_publisher, &bridge.vesc_message, NULL));
        consume_rcl_result(rcl_publish(&bridge.state_publisher, &bridge.state_message, NULL));
    }
}

static void micro_ros_task(void *argument)
{
    (void)argument;
    bridge_connection_state_t state = BRIDGE_WAITING_FOR_AGENT;
    TickType_t last_ping = 0;
    TickType_t last_imu = 0;
    TickType_t last_mag = 0;
    TickType_t last_state = 0;

    while (true) {
        TickType_t now = xTaskGetTickCount();
        switch (state) {
        case BRIDGE_WAITING_FOR_AGENT:
            if (rmw_uros_ping_agent(MICRO_ROS_AGENT_PING_TIMEOUT_MS,
                                    MICRO_ROS_AGENT_PING_ATTEMPTS) == RMW_RET_OK) {
                state = BRIDGE_AGENT_AVAILABLE;
            } else {
                vTaskDelay(pdMS_TO_TICKS(MICRO_ROS_RETRY_PERIOD_MS));
            }
            break;
        case BRIDGE_AGENT_AVAILABLE:
            if (create_entities()) {
                last_ping = now;
                last_imu = now;
                last_mag = now;
                last_state = now;
                state = BRIDGE_AGENT_CONNECTED;
            } else {
                ESP_LOGE(TAG, "Failed to create ROS 2 entities; retrying");
                destroy_entities();
                state = BRIDGE_WAITING_FOR_AGENT;
            }
            break;
        case BRIDGE_AGENT_CONNECTED:
            if (now - last_ping >= pdMS_TO_TICKS(MICRO_ROS_AGENT_PING_PERIOD_MS)) {
                last_ping = now;
                if (rmw_uros_ping_agent(MICRO_ROS_AGENT_PING_TIMEOUT_MS,
                                        MICRO_ROS_AGENT_PING_ATTEMPTS) != RMW_RET_OK) {
                    state = BRIDGE_AGENT_DISCONNECTED;
                    break;
                }
            }
            (void)rclc_executor_spin_some(&bridge.executor, RCL_MS_TO_NS(5));
            publish_periodic(now, &last_imu, &last_mag, &last_state);
            vTaskDelay(pdMS_TO_TICKS(2));
            break;
        case BRIDGE_AGENT_DISCONNECTED:
            ESP_LOGW(TAG, "Agent disconnected; stopping actuators");
            destroy_entities();
            state = BRIDGE_WAITING_FOR_AGENT;
            break;
        }
    }
}

esp_err_t micro_ros_bridge_start(const micro_ros_bridge_config_t *config)
{
    if (config == NULL || config->steering == NULL || config->vesc == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    memset(&bridge, 0, sizeof(bridge));
    bridge.hardware = *config;

#if defined(RMW_UXRCE_TRANSPORT_CUSTOM)
    if (rmw_uros_set_custom_transport(true, &cdc_port,
                                      esp_usbcdc_open, esp_usbcdc_close,
                                      esp_usbcdc_write, esp_usbcdc_read) != RMW_RET_OK) {
        return ESP_FAIL;
    }
#else
#error "micro-ROS must be built with RMW_UXRCE_TRANSPORT=custom"
#endif

    if (xTaskCreate(micro_ros_task, "micro_ros", MICRO_ROS_TASK_STACK_SIZE,
                    NULL, MICRO_ROS_TASK_PRIORITY, NULL) != pdPASS) {
        return ESP_ERR_NO_MEM;
    }
    ESP_LOGI(TAG, "USB-CDC bridge started; waiting for micro-ROS Agent");
    return ESP_OK;
}
